{"class_name": "Sequential", "keras_version": "2.0.8", "backend": "tensorflow", "config": [{"class_name": "Masking", "config": {"batch_input_shape": [null, 3, 11], "mask_value": -1, "dtype": "float32", "trainable": true, "name": "masking_1"}}, {"class_name": "LSTM", "config": {"units": 32, "activation": "tanh", "kernel_regularizer": null, "recurrent_dropout": 0.0, "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "batch_input_shape": [null, 3, 11], "recurrent_regularizer": null, "return_sequences": false, "dtype": "float32", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "lstm_1", "dropout": 0.2, "trainable": true, "return_state": false, "implementation": 0, "recurrent_activation": "hard_sigmoid", "bias_regularizer": null, "unit_forget_bias": true, "unroll": false, "stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null, "go_backwards": false}}, {"class_name": "Dense", "config": {"units": 6, "activation": "linear", "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 32], "kernel_constraint": null, "dtype": "float32", "name": "dense_1"}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_1"}}]}